# Chapter 14. Pandas 데이터 분석

In [1]:
import pandas as pd

## series

In [3]:
#ex 14-1

obj = pd.Series([5, -1, 7, 0, 12])
obj

0     5
1    -1
2     7
3     0
4    12
dtype: int64

In [4]:
# ex 14-2

obj.values

array([ 5, -1,  7,  0, 12], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
obj[2]

7

In [8]:
#ex 14-3
obj=pd.Series([10,20,30,40,50], index=['a', 'b', 'c', 'd', 'e'])
obj

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [9]:
obj.values

array([10, 20, 30, 40, 50], dtype=int64)

In [10]:
obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
obj['a']

10

In [13]:
obj[['b','d']]

b    20
d    40
dtype: int64

In [14]:
obj['b':'d']

b    20
c    30
d    40
dtype: int64

In [15]:
#ex 14-4

obj*10

a    100
b    200
c    300
d    400
e    500
dtype: int64

In [16]:
obj[obj>25]

c    30
d    40
e    50
dtype: int64

In [18]:
# ex 14-5
pop=pd.Series([9765623,344153,2461769], index=['서울', '부산', '대구'])

In [19]:
for i, v in pop.items():            #i = index, v=value
    print('%s:%d' %(i,v))

서울:9765623
부산:344153
대구:2461769

In [20]:
for item in pop:
    print(item)

9765623
344153
2461769

In [21]:
pop

서울    9765623
부산     344153
대구    2461769
dtype: int64

In [23]:
# ex 14-6
pop=pd.Series({'서울':9765623, '부산':3441453, '대구':2461769})
pop

서울    9765623
부산    3441453
대구    2461769
dtype: int64

In [26]:

pop=pd.Series({'서울':9765623, '부산':3441453, '대구':2461769},
              index=['서울', '부산', '대구', '광주', '대전'])
pop

서울    9765623.0
부산    3441453.0
대구    2461769.0
광주          NaN
대전          NaN
dtype: float64

In [25]:

pop=pd.Series([9765623,344153,2461769], index=['서울', '부산', '대구','광주', '대전'])

ValueError: Length of passed values is 3, index implies 5.

In [27]:
pop.isna()

서울    False
부산    False
대구    False
광주     True
대전     True
dtype: bool

In [30]:
pop=pop.fillna(0)
pop

서울    9765623.0
부산    3441453.0
대구    2461769.0
광주          0.0
대전          0.0
dtype: float64

In [31]:
pop.sum()

15668845.0

In [32]:
pop.mean()

3133769.0

## DataFrame

In [35]:
#ex 14-7
data={'이름':['홍지수', '안지영', '김성수', '최예린'],
     '아이디':['jshong', 'jyahn', 'sukim', 'yrchoi'],
     '비밀번호':['1234','1234','1234','1234']}

df=pd.DataFrame(data)
df

    이름     아이디  비밀번호
0  홍지수  jshong  1234
1  안지영   jyahn  1234
2  김성수   sukim  1234
3  최예린  yrchoi  1234

In [40]:
df['이름']

0    홍지수
1    안지영
2    김성수
3    최예린
Name: 이름, dtype: object

In [41]:
df[0]

KeyError: 0

In [42]:
df['이름'][0]

'홍지수'

In [46]:
#ex 14-8

member = {'이름':['김영준','한지원'],
         '나이':[20,23],
         '전화번호':['010-1234-1234','010-2435-4354']}
member

{'이름': ['김영준', '한지원'],
 '나이': [20, 23],
 '전화번호': ['010-1234-1234', '010-2435-4354']}

In [47]:
df = pd.DataFrame(member,
                 columns=['이름','전화번호','나이','주소'],
                 index=['01','02'])
df

     이름           전화번호  나이   주소
01  김영준  010-1234-1234  20  NaN
02  한지원  010-2435-4354  23  NaN

### R : Retrieval

In [50]:
# ex 14-9

data={'학교명':['가나고', '다라고', '마바고', '사아고', '자차고'],
     '학급수':['25','23','15','19','10'],
      '학생수':['620','600','550','580','400'],
     '교사수':['80','95','70','90','65']}

df=pd.DataFrame(data, index=['01','02','03','04','05'])
df

    학교명 학급수  학생수 교사수
01  가나고  25  620  80
02  다라고  23  600  95
03  마바고  15  550  70
04  사아고  19  580  90
05  자차고  10  400  65

In [55]:
df['학생수'][2]

'550'

In [57]:
df['학생수']['03']

'550'

In [56]:
#location method : [row index, column index]
df.loc['03','학생수']

'550'

In [58]:
df.loc['04',['학교명', '학급수', '교사수']]

학교명    사아고
학급수     19
교사수     90
Name: 04, dtype: object

In [66]:
# ex 14-9

data={'아이디':['kim', 'song', 'han', 'choi'],
     '구매상품':['상품A','상품B','상품C','상품D'],
      '가격':['15000','23000','33000','50000'],
      '개수':[3,5,1,10],
     '구매일':['0303','0810','0120','0601']}

df=pd.DataFrame(data)
df

    아이디 구매상품     가격  개수   구매일
0   kim  상품A  15000   3  0303
1  song  상품B  23000   5  0810
2   han  상품C  33000   1  0120
3  choi  상품D  50000  10  0601

In [68]:
df['개수'][1], df.loc[1,'개수']

(5, 5)

In [70]:
df.iloc[1]

아이디      song
구매상품      상품B
가격      23000
개수          5
구매일      0810
Name: 1, dtype: object

In [72]:
df.iloc[1,3]

5

In [75]:
df.iloc[1, :]

아이디      song
구매상품      상품B
가격      23000
개수          5
구매일      0810
Name: 1, dtype: object

In [76]:
df.iloc[1, 1:]

구매상품      상품B
가격      23000
개수          5
구매일      0810
Name: 1, dtype: object

### 데이터 조작

In [80]:
#14-11

scores = {'이름':['김지영', '안지수', '최성수', '황예린', '김소정'],
         '국어':[95,97,90,94,87],
         '영어':[90,86,93,85,93],
         '수학':[85,88,89,88,99]}


df=pd.DataFrame(scores)

df

    이름  국어  영어  수학
0  김지영  95  90  85
1  안지수  97  86  88
2  최성수  90  93  89
3  황예린  94  85  88
4  김소정  87  93  99

In [82]:
df2 = df.iloc[:, [1,2,3]]
df2

   국어  영어  수학
0  95  90  85
1  97  86  88
2  90  93  89
3  94  85  88
4  87  93  99

In [89]:
df2.sum(axis=1)

0    270
1    271
2    272
3    267
4    279
dtype: int64

In [90]:
df['합계']=df2.sum(axis=1)
df

    이름  국어  영어  수학   합계         평균
0  김지영  95  90  85  270  90.000000
1  안지수  97  86  88  271  90.333333
2  최성수  90  93  89  272  90.666667
3  황예린  94  85  88  267  89.000000
4  김소정  87  93  99  279  93.000000

In [91]:
# ex 14-12

df2.mean(axis=1)

0    90.000000
1    90.333333
2    90.666667
3    89.000000
4    93.000000
dtype: float64

In [92]:
df['평균']=df2.mean(axis=1)
df

    이름  국어  영어  수학   합계         평균
0  김지영  95  90  85  270  90.000000
1  안지수  97  86  88  271  90.333333
2  최성수  90  93  89  272  90.666667
3  황예린  94  85  88  267  89.000000
4  김소정  87  93  99  279  93.000000

In [94]:
df[['이름','합계','평균']]

    이름   합계         평균
0  김지영  270  90.000000
1  안지수  271  90.333333
2  최성수  272  90.666667
3  황예린  267  89.000000
4  김소정  279  93.000000

In [95]:
df.count()

이름    5
국어    5
영어    5
수학    5
합계    5
평균    5
dtype: int64

In [96]:
len(df)

5

### 정렬

In [97]:
df

    이름  국어  영어  수학   합계         평균
0  김지영  95  90  85  270  90.000000
1  안지수  97  86  88  271  90.333333
2  최성수  90  93  89  272  90.666667
3  황예린  94  85  88  267  89.000000
4  김소정  87  93  99  279  93.000000

In [104]:
df=df.sort_values(by=['합계'])
df

    이름  국어  영어  수학   합계         평균
3  황예린  94  85  88  267  89.000000
0  김지영  95  90  85  270  90.000000
1  안지수  97  86  88  271  90.333333
2  최성수  90  93  89  272  90.666667
4  김소정  87  93  99  279  93.000000

### apply 변환

In [105]:
df=pd.DataFrame({
    'A':[1,3,4,3,4],
    'B':[2,3,1,2,3],
    'C':[1,5,2,4,4]
})
df

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [107]:
# default axis=0
df.apply(lambda x: x.max()-x.min())

A    3
B    2
C    4
dtype: int64

In [108]:
# 행에 대해서 적용 axis=1
df.apply(lambda x: x.max()-x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [109]:
df.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [110]:
df.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

# 데이터 입출력

In [115]:
# CSV 파일을 리스트로 저장

import population as pop

list_data=[]

pop.get_list(list_data)

print(list_data)

[['서울특별시  (1100000000)', '부산광역시  (2600000000)', '대구광역시  (2700000000)', '인천광역시  (2800000000)', '광주광역시  (2900000000)', '대전광역시  (3000000000)', '울산광역시  (3100000000)', '세종특별자치시  (3600000000)', '경기도  (4100000000)', '강원도  (4200000000)', '충청북도  (4300000000)', '충청남도  (4400000000)', '전라북도  (4500000000)', '전라남도  (4600000000)', '경상북도  (4700000000)', '경상남도  (4800000000)', '제주특별자치도  (5000000000)'], ['9,736,962', '3,410,925', '2,432,883', '2,954,955', '1,456,121', '1,473,125', '1,145,710', '343,788', '13,265,377', '1,539,521', '1,598,599', '2,120,995', '1,815,112', '1,861,894', '2,658,956', '3,358,828', '670,876'], ['4,345,877', '1,502,333', '1,033,349', '1,242,107', '618,503', '637,726', '469,551', '136,629', '5,497,087', '721,003', '723,931', '961,890', '818,452', '873,871', '1,229,265', '1,455,655', '293,932'], ['      2.24', '      2.27', '      2.35', '      2.38', '      2.35', '      2.31', '      2.44', '      2.52', '      2.41', '      2.14', '      2.21', '      2.21', '      2.22', '      2.13', '      2.16', '      2.31', '      2.28'], ['4,745,133', '1,673,266', '1,202,364', '1,481,133', '720,686', '735,791', '588,626', '171,403', '6,672,706', '774,358', '809,805', '1,081,153', '902,365', '934,900', '1,338,907', '1,690,600', '337,295'], ['4,991,829', '1,737,659', '1,230,519', '1,473,822', '735,435', '737,334', '557,084', '172,385', '6,592,671', '765,163', '788,794', '1,039,842', '912,747', '926,994', '1,320,049', '1,668,228', '333,581'], ['      0.95', '      0.96', '      0.98', '      1.00', '      0.98', '      1.00', '      1.06', '      0.99', '      1.01', '      1.01', '      1.03', '      1.04', '      0.99', '      1.01', '      1.01', '      1.01', '      1.01']]